In [1]:
import numpy as np
from pandas import DataFrame, Series

In [2]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [3]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [4]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [5]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [6]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(skipna=False)

one   NaN
two   NaN
dtype: float64

In [8]:
df.mean(axis=1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df.idxmin()

one    d
two    b
dtype: object

In [11]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [12]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [13]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [14]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [15]:
df = DataFrame([[1, 2], [3, 4],[5, 6], [7, 8]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df

   one  two
a    1    2
b    3    4
c    5    6
d    7    8

In [16]:
df.describe()

            one       two
count  4.000000  4.000000
mean   4.000000  5.000000
std    2.581989  2.581989
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  5.000000
75%    5.500000  6.500000
max    7.000000  8.000000

In [17]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [18]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [19]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [20]:
obj.value_counts(sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [21]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [22]:
import pandas as pd
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0